# Задача 1. Python!
# Напишите программу, которая выводит в отдельную строчку каждый символ фразы “Python!”.
#
#
#
phrase = "Python!"
for symbol in phrase:
    print(symbol)
