# В Python так много полезных встроенных модулей, которые можно использовать для достижения вашей цели
# в нескольких строках кода. Одним из таких модулей в Python является модуль календаря, который обеспечивает
# доступ к календарю любого месяца любого года. В любое время, когда вы хотите показать календарь пользователю,
# этот модуль Python пригодится.
# Теперь вот как вы можете легко написать программу для печати календаря с помощью Python:

import calendar
print(calendar.month(2021, 9))